# IsMultipleNetwork Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..IsMultipleNetwork Property
MEPSystem Class See Also
---
Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsMultipleNetwork { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsMultipleNetwork As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsMultipleNetwork {
	bool get ();
}
```

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace